//2.Задан двумерный массив NxN вещественных чисел, N=5. Необходимо каждый
//элемент соответствующей строки разделить на сумму элементов этой же строки. 

#include <stdio.h>

int main(){
	float A[5][5] = {{1.1, 2.2, 3.3, 4.4, 5.5},
					 {6.6, 7.7, 8.8, 9.9, 10.0},
					 {11.1, 12.2, 13.3, 14.4, 15.5},
					 {16.6, 17.7, 18.8, 19.9, 20.0},
					 {21.1, 22.2, 23.3, 24.4, 25.5}};		
		
	for(int i = 0; i < 5; i++){
		for(int j = 0;j < 5;j++){
			printf("%.1f ", A[i][j]); 
		}
		printf("\n"); 
	}
		
	printf("\n");
	
	for (int i = 0; i < 5; i++) {
		float sum = 0;
		for (int j = 0; j < 5; j++){
			sum += A[i][j]; 
		}
		for (int j = 0; j < 5; j++){
			A[i][j] /= sum; 
		}
	}
	for(int i = 0; i < 5; i++){
		for(int j = 0;j < 5;j++){
			printf("%.6f ", A[i][j]); 
		}
		printf("\n"); 
	}
	return 0;
}

