//Матрица А имеет размерность 5х5. Найти транспонированную к А матрицу (т.е. поменять местами строки и столбцы).

#include <stdio.h>

int main() {
	int A[5][5] = {{1, 1, 1, 1, 1},
				   {2, 2, 2, 2, 2},
				   {3, 3, 3, 3, 3},
				   {4, 4, 4, 4, 4},
				   {5, 5, 5, 5, 5}};
	int B[5][5];
	for (int i = 0; i < 5; i++){
		for (int j = 0; j < 5; j++){
			B[j][i] = A[i][j]; 
		} 
	}
	for (int i = 0; i < 5; i++){
		for (int j = 0; j < 5; j++){
			printf("%d ", B[i][j]); 
		}
		printf("\n"); 
	}
	return 0; 
}
